Exercises/WS_Exercises-master/HelloWorldBPELAppClient/xml-resources/web-service-references/helloWorldPort/wsdl/localhost_9080/helloWorldService/helloWorldPort.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="helloWorld" targetNamespace="http://helloworld.ws" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://helloworld.ws" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <types>
  </types>
  <message name="helloWorldRequest">
    <part name="part1" type="xsd:string">
    </part>
  </message>
  <message name="helloWorldResponse">
    <part name="part1" type="xsd:string">
    </part>
  </message>
  <portType name="helloWorldPortType">
    <operation name="helloWorld">
      <input name="input1" message="tns:helloWorldRequest">
    </input>
      <output name="output1" message="tns:helloWorldResponse">
    </output>
    </operation>
  </portType>
  <binding name="helloWorldBinding" type="tns:helloWorldPortType">
    <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="helloWorld">
      <soap:operation/>
      <input name="input1">
        <soap:body use="literal" namespace="http://helloworld.ws"/>
      </input>
      <output name="output1">
        <soap:body use="literal" namespace="http://helloworld.ws"/>
      </output>
    </operation>
  </binding>
  <service name="helloWorldService">
    <port name="helloWorldPort" binding="tns:helloWorldBinding">
      <soap:address location="http://ptc184.tt.com.pl:9080/helloWorldService/helloWorldPort"/>
    </port>
  </service>
    <plnk:partnerLinkType name="helloWorld">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="helloWorldPortTypeRole" portType="tns:helloWorldPortType"/>
    </plnk:partnerLinkType>
</definitions>
